Revit 2027 API
GroupTypeId.EnergyAnalysisBuildingData Property
 Building Data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisBuildingData { get; }
Public Shared ReadOnly Property EnergyAnalysisBuildingData As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisBuildingData {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisBuildingData : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace